# კომენტარებით ვწერთ რასაც გვინდა რადგან ამას კომპიუტერი აიგნორებს
# ამას ძირითადად ვიყენებთ ჩვენი კოდის ასაღწერად 
# იქმნება # ანუ დიეზის მეშვეობთ

# ქეის სენსიტიობა ნიშნავს იმას რომ პროგრამირების ენა აქცევს ყურადღებას
# დიდ ასოს დაწერ თუ პატარას და შეიძლება ამის გამო ერორი დაუშვა

name = "Toko"
print(name)
# ამ შემთხვევაში Name-ის ჩაწერა არასწორი იქნებოდა რადგან ჩვენ ცვლადი
# შენახული გვაქვს პატარა ასოთი (name)

# snake case არის _ და მას ვიყენებთ რომ გავამარტივოთ წაკითხვის საშუალება
# მაგალითად userfavoriteanimal რთული წასაკითხია
# მაგრამ user_favorite_animal უფრო მარტივი
my_favorite_animal = "jellyfish"
age_of_user = 16
favorite_number = "11"

# debugging არის კოდის შემოწმება და ბაგების ანუ შეცდომების შესწორება

# დავალებაში მოცემული არასწორი კოდის სწორი ვერსია:
print("Hello world")
city = "London"
print(city)
